<template>
  <section id="subjects">
    <mu-container>
      <span class="lookup-subject color-primary" @click="open = (!open)">查看科目</span>
      <mu-drawer :open.sync="open" :docked="false" width="280" :z-depth="24">
        <div>
          小六上 數學e名師<br/>
          升私中資優數學e名師<br/>
          國一上 國文．柳吟國文e名師<br/>
          國一上 數學e名師<br/>
          國一上 英語e名師<br/>
          國一上 自然e名師<br/>
          國一上 社會e名師<br/>
          國一上學期 全科e名師<br/>
          國一全學年 全科e名師<br/>
          國二上 國文．柳吟國文e名師<br/>
          國二上 數學e名師<br/>
          國二上 英語e名師<br/>
          國二上 自然e名師<br/>
          國二上 社會e名師<br/>
          國二全學年 全科e名師<br/>
          國二上學期 全科e名師<br/>
          國三上 國文．柳吟國文e名師<br/>
          國三上 數學e名師<br/>
          國三上 英語e名師<br/>
          國三上 自然e名師<br/>
          國三上 社會e名師<br/>
          國三上學期全科e名師<br/>
          國三全學年 全科e名師<br/>
          國中會考衝刺班e名師<br/>
          國中會考總複習 國文e名師<br/>
          國中會考總複習 數學e名師<br/>
          國中會考總複習 英語e名師<br/>
          國中會考總複習 生物e名師<br/>
          國中會考總複習 理化e名師<br/>
          國中會考總複習
          地球科學e名師<br/>
          國中會考總複習 地理e名師<br/>
          國中會考總複習 歷史e名師<br/>
          國中會考總複習 公民e名師<br/>
          國中寫作速成e名師<br/>
          高一上 國文古文．柳吟國文e名師<br/>
          高一上 英文．百大英文e名師<br/>
          高一上 數學．傅壹數學e名師<br/>高中
          基礎物理(一)．鎮麟物理e名師<br/>
          高中 基礎化學(一)．王宇化學e名師<br/>
          高中 基礎生物(上)．殷琴生物e名師<br/>
          高中 地球科學(上)．弘理社會e名師<br/>
          高一上 地理．弘理社會e名師<br/>
          高一上 歷史．天豪社會e名師<br/>
          高一上 歷史．弘理社會e名師<br/>
          高一上 公民．弘理社會e名師<br/>
          高一上 歷史段考特訓e名師<br/>
          高一上 地理段考特訓e名師<br/>
          高一上 公民段考特訓e名師<br/>
          高一全學年 全科（搭配歷史．弘理社會）<br/>
          高一全學年 全科（搭配歷史．天豪社會）<br/>
          高二上 國文古文．柳吟國文e名師<br/>
          高二上 英文．百大英文e名師<br/>
          高二上 數學．傅壹數學e名師<br/>
          高中 基礎物理(二)B上．鎮麟物理e名師<br/>
          高中 基礎化學(二)．王宇化學e名師<br/>
          高中 基礎生物(下)．殷琴生物e名師<br/>
          高中 地球科學(下)．弘理社會e名師<br/>
          高二上 地理．弘理社會e名師<br/>
          高二上 歷史．弘理社會e名師<br/>
          高二上 公民．弘理社會e名師<br/>
          高二上 歷史段考特訓e名師<br/>
          高二上 地理段考特訓e名師<br/>
          高二上 公民段考特訓e名師<br/>
          高二全學年 全科(社會組)<br/>
          高二全學年 全科(自然組)<br/>
          高三上 國文古文．柳吟國文e名師<br/>
          高中學測總複習 國文e名師<br/>
          高中學測總複習 英文e名師<br/>
          高中學測總複習
          數學e名師<br/>
          高中學測總複習 物理e名師<br/>
          高中學測總複習 化學e名師<br/>
          高中學測總複習 生物e名師<br/>
          高中學測總複習 地球科學e名師<br/>
          高中學測總複習 地理e名師<br/>
          高中學測總複習 地理e名師<br/>
          高中學測總複習
          歷史e名師<br/>
          高中學測總複習 公民e名師<br/>
          高中學測總複習 作文e名師<br/>
          高中學測總複習 超值全修班<br/>
          高中學測總複習 超強主科班<br/>
          高中學測總複習 社會拿分班<br/>
          高中學測總複習 自然頂標班<br/>
          高中指考總複習
          國文e名師<br/>
          高中指考總複習 英文e名師<br/>
          高中指考總複習 數學甲e名師<br/>
          高中指考總複習 數學乙e名師<br/>
          高中指考總複習 物理e名師<br/>
          高中指考總複習 化學e名師<br/>
          高中指考總複習 生物e名師<br/>
          高中指考總複習
          地理e名師<br/>
          高中指考總複習 歷史e名師<br/>
          高中指考總複習 公民e名師<br/>
          高中指考總複習 自然組e名師<br/>
          高中指考總複習 社會組e名師<br/>
          高中作文實力養成(一)e名師<br/>
          高中作文實力養成(二)e名師
        </div>
      </mu-drawer>
    </mu-container>
  </section>
</template>

<script>
  export default {
    name: 'SuitableProduct',
    data () {
      return {
        open: false
      }
    }
  }
</script>

<style scoped lang="less">
  #subjects {
    span.lookup-subject {
      display: inline-block;
      width: 120px;
      font-weight: 600;
    }

    .mu-drawer {
      div {
        font-size: 16px;
        color: #625f60;
      }
    }
  }
</style>
